# age = 0

# while age < 18:
#     print(f"Мне {age} лет. Я ребёнок")
#     age += 1
# print("Пора в универ!")


# i = 0
# while i < 5:
#     print("Привет")
#     i += 1


# Задача 1
# a = 1
# b = "Максим амёба"

# while a <= 10:
#     print(a, b)
#     a += 1


# Задача 2

# price = 20
# allMoney = 110

# while allMoney >= price:
#     print("Вы купили товар")
#     allMoney -= price
#     print(f"У вас осталось {allMoney} рублей")

# # Практическая задача №2

# print("У вас мало денег для покупки")


# print ("Игра - Отгадай число\n")
# randomNumber = 5
# inputNumber = int(input("Угадай какое число я загадал (1-10): "))

# while randomNumber != inputNumber:
#     if randomNumber < inputNumber:
#         print("Загаданное число меньше")
#     else: 
#         print("Загаданное число больше")
#     inputNumber = int(input("Попробуйте ещё раз: "))

# print("Вы угадали загаданное число")


# Цикл FOR

# for i in range(0, 51):
#     print(Hello, world)


# Задача №4

# summa = 0
# N = int(input("Введите число"))
# for i in range(1, N + 1):  
#     summa += i
#     print (summa)

# summa = 1
# N = int(input("Введите число"))
# for i in range(1, N * 1):  
#     summa *= i
#     print (summa)
    
